// *++
	//
// Copyright (c) 2007 - 2010, Intel Corporation. All rights reserved.<BR>
// This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution.  The full text of the license may be found at        
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//  BDStrings.uni
// 
// Abstract:
// 
//   String definitions for Sample Setup formset.
// 
// Revision History:
// 
// --*/


/=#

#langdef en-US  "English"
#langdef fr-FR  "Francais"


#string STR_FORM_SET_TITLE             #language en-US "Blank Driver Configuration page"
                                       #language fr-FR "Blank Driver Configuration page"
#string STR_FORM_SET_TITLE_HELP        #language en-US "This is a Blank Driver sample driver which is used to test the browser op-code operations.  This is for development purposes and not to be distributed in any form other than a test application.  Here is a set of wide \wideAAAAAAAAA\narrow and narrow AAA!"
                                       #language fr-FR "This is a Blank Driver sample driver which is used to test the browser op-code operations.  This is for development purposes and not to be distributed in any form other than a test application.  Here is a set of wide \wideAAAAAAAAA\narrow and narrow AAA!"
#string STR_FORM1_TITLE                #language en-US "BlankDrv Setup Page"
                                       #language fr-FR "BlankDrv Arreglo Página"
#string STR_STANDARD_DEFAULT_PROMPT    #language en-US "Reset to Standard Default"
                                       #language fr-FR "Reset to Standard Default"
#string STR_STANDARD_DEFAULT_HELP      #language en-US "This will reset all the Questions to their standard default value"
                                       #language fr-FR "This will reset all the Questions to their standard default value"
#string STR_MANUFACTURE_DEFAULT_PROMPT #language en-US "Reset to Manufacture Default"
                                       #language fr-FR "Reset to Manufacture Default"
#string STR_MANUFACTURE_DEFAULT_HELP   #language en-US "This will reset all the Questions to their manufacture default value"
                                       #language fr-FR "This will reset all the Questions to their manufacture default value"
#string STR_SUBTITLE_TEXT              #language en-US "BlankDrv Configuration"
                                       #language fr-FR "Mi texto del subtítulo"
#string STR_SUBTITLE_TEXT2             #language en-US " "
                                       #language fr-FR " "
#string STR_ONE_OF_PROMPT              #language en-US "Select Base Address"
                                       #language fr-FR "Mi uno- de guía # 1"
#string STR_ONE_OF_HELP                #language en-US "Select a Base address of 400, 480 or 500 Hex.  Values 0,1 or 2(default) is stored in the NVRAM Data" 
                                       #language fr-FR "Mi uno- de ayuda va a ser una cadena larga a probar fuera de la eficacia de la capacidad del yo es cansada de capacidades el pulsar."
#string STR_ONE_OF_TEXT1               #language en-US "400 Hex"
                                       #language fr-FR "Mi uno- del texto # 4"
#string STR_ONE_OF_TEXT2               #language en-US "480 Hex"
                                       #language fr-FR "Mi uno- del texto # 5"
#string STR_ONE_OF_TEXT3               #language en-US "500 Hex"
                                       #language fr-FR "Mi uno- del texto # 6"
#string STR_STANDARD_DEFAULT_PROMPT    #language en-US "Standard Default"
                                       #language fr-FR "Standard Default"
#string STR_MANUFACTURE_DEFAULT_PROMPT #language en-US "Manufacture Default"
                                       #language fr-FR "Manufacture Default"
#string STR_MY_STRING_PROMPT           #language en-US "Enter a String"
                                       #language fr-FR "String - interactive"
#string STR_MY_STRING_HELP             #language en-US "Enter a string that is 6 to 40 characters - Interactive"
                                       #language fr-FR "This is my string help - interactive"
#string STR_DATA_HEX_PROMPT            #language en-US "Enter Base (Hex)"
                                       #language fr-FR "Cómo viejo es usted? (Hex)"

#string STR_NUMERIC_HELP               #language en-US "This is the help for entering a Base address in Hex. The valid range in this case is from 0 to 250."
                                       #language fr-FR "This is the help for entering a Base address in Hex. The valid range in this case is from 0 to 250."

#string STR_EXIT_TEXT                  #language en-US "Exit now!"
                                       #language fr-FR "Salir ahora!"
#string STR_SAVE_TEXT                  #language en-US "Save now!"
                                       #language fr-FR "(French)Save now!"
 